/*
    퀵정렬
    worst - O(nlog2n)
    best - O(n**2)
    피봇값(기준값)을 맨앞, 맨뒤, 가운데   또는 피봇값을 2개로 줄때도있음. worst를 피하기 위해서 랜덤으로 잡기도함.

    [66, 77, 54, 32, 10, 5, 11, 15]

    피봇값: 66 (맨앞)
    shift [54, 32, 10, 5, 11, 15] + [66] + [77]

    피봇값: 54
    shift [32, 10, 5, 11, 15] + [54] + [66] + [77]

    피봇값: 32
    shift [10, 5, 11, 15] + [32] + [54] + [66] + [77]

    피봇값: 10
    [5] + [10] + [11, 15] + [32] + [54] + [66] + [77]

    피봇값: 11 (array중 하나가아닌곳)
    [5] + [10] + [11] + [15] + [32] + [54] + [66] + [77]
*/

let arr = [66, 77, 54, 32, 10, 5, 11, 15];

function quickSort(arr) {
    let arrLength = arr.length;
    let pivot = arr[0];
}
